Revit 2027 API
Application Properties
The Application type exposes the following members.
Properties
Name | Description
ActiveAddInId | Retrieves the Id of the currently running external application.
AllowNavigationDuringRedraw |  Checks whether or not the navigation during redraw is enabled, and enable or disable it.
AllUsersAddinsLocation |  The folder location for .addin files for all users.
AngleTolerance |  Angle tolerance.
BackgroundColor |  The background color to use for model views in this session.
Cities | Returns a set of all the known city locations within Revit.
Create | Provides an object that can be used to create new instances of Autodesk Revit API objects.
CurrentRevitServerAccelerator |  Current Revit Server accelerator.
CurrentUserAddinsLocation |  The folder location for .addin files for the current user.
CurrentUsersAddinsDataFolderPath |  Path to AddinsData folder for the current user.
CurrentUsersDataFolderPath |  Path to data folder for the current user.
DefaultIFCProjectTemplate |  Full path to the default template file for new IFC project documents. It may be empty, in which case the DefaultProjectTemplate should be used.
DefaultProjectTemplate |  Full path to the default template file for new project documents.
DefaultViewDiscipline |  The view discipline that will be applied to new views by default.
Documents |  Returns a set of documents within Revit.
ExportIFCCategoryTable |  Full path to the file that defines Revit category to IFC entity mappings for IFC export.
FamilyTemplatePath |  Default path for family template files.
ImportIFCCategoryTable |  Full path to the file that defines IFC entity to Revit category mappings for IFC import.
IsArchitectureEnabled |  Checks whether or not the architecture discipline is enabled, and enable or disable it.
IsConcreteEnabled |  Checks whether or not the concrete discipline is enabled, and enable or disable it.
IsElectricalAnalysisEnabled |  Checks whether or not electrical analysis is enabled, and enable or disable it.
IsElectricalEnabled |  Checks whether or not the electrical discipline is enabled, and enable or disable it.
IsEnergyAnalysisEnabled |  Checks whether or not energy analysis is enabled, and enable or disable it.
IsInfrastructureEnabled |  Checks whether or not infrastructure discipline is enabled, and enable or disable it.
IsLoggedIn |  Checks if the user is logged in from this session to their Autodesk account.
IsMassingEnabled |  Checks whether or not the massing and site tools are enabled, and enable or disable them.
IsMechanicalAnalysisEnabled |  Checks whether or not mechanical analysis is enabled, and enable or disable it.
IsMechanicalEnabled |  Checks whether or not the mechanical discipline is enabled, and enable or disable it.
IsPipingAnalysisEnabled |  Checks whether or not piping analysis is enabled, and enable or disable it.
IsPipingEnabled |  Checks whether or not the piping discipline is enabled, and enable or disable it.
IsPrecastEnabled |  Checks whether or not the precast is enabled, and enable or disable it.
IsRouteAnalysisEnabled |  Checks whether or not route analysis is enabled, and enable or disable it.
IsStructuralAnalysisEnabled |  Checks whether or not the structural analysis is enabled, and enable or disable it.
IsStructureEnabled |  Checks whether or not the structure discipline is enabled, and enable or disable it.
IsSystemsEnabled |  Checks whether or not any systems disciplines (mechanical, electrical, or piping) are enabled.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Language | The language used in the current session of Revit.
LoginUserId |  The user id of the user currently logged in. The user id will be empty if the user is not logged in.
MinimumThickness |  The minimum thickness allowed in Revit for a variety of geometric constructs. These include blends, extrusions, and wall layers.
PointCloudsRootPath |  Root path for point cloud files.
Product |  The product type for the current session of Revit.
RecordingJournalFilename |  Retrieve the name of the journal file the Revit is currently recording to.
SharedComponentsLocation |  Location of shared components used by Revit.
SharedParametersFilename | Contains the fully qualified path to a shared parameters file.
ShortCurveTolerance |  The enforced minimum length for any curve created by Revit.
ShowGraphicalOpenEndsAreaBasedLoadBoundaryDisconnects |  Whether or not to show the graphical open ends for Area Based Load Boundary disconnects.
ShowGraphicalWarningCableTrayConduitDisconnects |  Whether or not to show the graphical warnings for CTC disconnects.
ShowGraphicalWarningDuctDisconnects |  Whether or not to show the graphical warnings for duct disconnects.
ShowGraphicalWarningElectricalDisconnects |  Whether or not to show the graphical warnings for Electrical disconnects.
ShowGraphicalWarningHangerDisconnects |  Whether or not to show the graphical warnings for Fabrication Hanger disconnects.
ShowGraphicalWarningPipeDisconnects |  Whether or not to show the graphical warnings for Pipe disconnects.
SubVersionNumber |  The minor version number of Revit
SystemsAnalysisWorkfilesRootPath |  Root path for systems analysis workfiles
Username |  Gets the user name for the current Revit session.
VersionBuild |  Returns the internal build number of the Autodesk Revit application.
VersionName |  Returns the name of the Revit application.
VersionNumber |  Return the primary version of the Revit application.
VertexTolerance |  Vertex tolerance.
Top
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace